In [102]:
import pandas as pd

In [103]:
df1 = pd.read_csv('./data/tmdb_5000_credits.csv')
df2 = pd.read_csv('./data/tmdb_5000_movies.csv')

In [104]:
df1.head(1)

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [105]:
df2.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

In [106]:
df1.columns=['id', 'title', 'cast', 'crew']
df1.head(1)

,id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [107]:
temp=df1[['id', 'crew', 'cast']]
temp

,id,crew,cast
0,19995,"[{""credit_id"": ""52fe48009251416c750aca23"", ""de...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""..."
1,285,"[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de...","[{""cast_id"": 4, ""character"": ""Captain Jack Spa..."
2,206647,"[{""credit_id"": ""54805967c3a36829b5002c41"", ""de...","[{""cast_id"": 1, ""character"": ""James Bond"", ""cr..."
3,49026,"[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de...","[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba..."
4,49529,"[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de...","[{""cast_id"": 5, ""character"": ""John Carter"", ""c..."
...,...,...,...
4798,9367,"[{""credit_id"": ""52fe44eec3a36847f80b280b"", ""de...","[{""cast_id"": 1, ""character"": ""El Mariachi"", ""c..."
4799,72766,"[{""credit_id"": ""52fe487dc3a368484e0fb013"", ""de...","[{""cast_id"": 1, ""character"": ""Buzzy"", ""credit_..."
4800,231617,"[{""credit_id"": ""52fe4df3c3a36847f8275ecf"", ""de...","[{""cast_id"": 8, ""character"": ""Oliver O\u2019To..."
4801,126186,"[{""credit_id"": ""52fe4ad9c3a368484e16a36b"", ""de...","[{""cast_id"": 3, ""character"": ""Sam"", ""credit_id..."
4802,25975,"[{""credit_id"": ""58ce021b9251415a390165d9"", ""de...","[{""cast_id"": 3, ""character"": ""Herself"", ""credi..."

In [108]:
df2 = df2.merge(temp, on='id')
df2.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count,crew,cast
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800,"[{""credit_id"": ""52fe48009251416c750aca23"", ""de...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""..."

In [109]:
df2['overview']

0       In the 22nd century, a paraplegic Marine is di...
1       Captain Barbossa, long believed to be dead, ha...
2       A cryptic message from Bond’s past sends him o...
3       Following the death of District Attorney Harve...
4       John Carter is a war-weary, former military ca...
                              ...
4798    El Mariachi just wants to play his guitar and ...
4799    A newlywed couple's honeymoon is upended by th...
4800    "Signed, Sealed, Delivered" introduces a dedic...
4801    When ambitious New York attorney Sam is sent t...
4802    Ever since the second grade when he first saw ...
Name: overview, Length: 4803, dtype: object

In [110]:
from sklearn.feature_extraction.text import TfidfVectorizer
tfidf=TfidfVectorizer(stop_words='english')

In [111]:
df2['overview'].isnull().values.any()

True

In [112]:
df2['overview']=df2['overview'].fillna('')

In [113]:
matrix = tfidf.fit_transform(df2['overview'])

In [114]:
matrix.shape

(4803, 20978)

In [115]:
from sklearn.metrics.pairwise import linear_kernel
sim=linear_kernel(matrix, matrix)

In [116]:
sim.shape

(4803, 4803)

In [117]:
sim

array([[1.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.        , 1.        , 0.        , ..., 0.02160533, 0.        ,
        0.        ],
       [0.        , 0.        , 1.        , ..., 0.01488159, 0.        ,
        0.        ],
       ...,
       [0.        , 0.02160533, 0.01488159, ..., 1.        , 0.01609091,
        0.00701914],
       [0.        , 0.        , 0.        , ..., 0.01609091, 1.        ,
        0.01171696],
       [0.        , 0.        , 0.        , ..., 0.00701914, 0.01171696,
        1.        ]])

In [118]:
import pickle

In [119]:
pickle.dump(sim, open('./data/sim.pickle', 'wb'))

In [120]:
sim=pickle.load(open('./data/sim.pickle', 'rb'))

In [121]:
movies=pickle.load(open('./data/movies.pickle', 'rb'))

In [122]:
movies

          id                                     title
0      19995                                    Avatar
1        285  Pirates of the Caribbean: At World's End
2     206647                                   Spectre
3      49026                     The Dark Knight Rises
4      49529                               John Carter
...      ...                                       ...
4798    9367                               El Mariachi
4799   72766                                 Newlyweds
4800  231617                 Signed, Sealed, Delivered
4801  126186                          Shanghai Calling
4802   25975                         My Date with Drew

[4803 rows x 2 columns]

In [123]:
#1. 제목에 대한 인덱스값을 구한다.
filter = movies['title'] == 'The Dark Knight Rises'
idx = movies[filter].index[0]

In [124]:
#2.유사도 테이블에서 인덱스번째 유사도 데이터를 구한다.
sim_scores = sim[idx]

In [125]:
#3.영화인덱스번호, 유사도값을 배열로 생성
sim_scores = list(enumerate(sim_scores))

In [126]:
#4.유사도가 높은순으로 정렬
sim_scores=sorted(sim_scores, key=lambda x:x[1], reverse=True)

In [127]:
#5.상위 10개의 영화를 구한다.
sim_scores=sim_scores[1:13]
sim_scores

[(65, 0.30151176591665485),
 (299, 0.29857045255396825),
 (428, 0.2878505467001694),
 (1359, 0.264460923827995),
 (3854, 0.18545003006561456),
 (119, 0.16799626199850706),
 (2507, 0.16682891043358278),
 (9, 0.1337400906655523),
 (1181, 0.13219702138476813),
 (210, 0.13045537014449818),
 (879, 0.1050189187666832),
 (2193, 0.10165255714476643)]

In [128]:
#6.영화 인덱스 배열생성
sim_movies = [i[0] for i in sim_scores]
sim_movies

[65, 299, 428, 1359, 3854, 119, 2507, 9, 1181, 210, 879, 2193]

In [130]:
for i in range(12):
    title=movies['title'].iloc[sim_movies[i]]
    print(title)

The Dark Knight
Batman Forever
Batman Returns
Batman
Batman: The Dark Knight Returns, Part 2
Batman Begins
Slow Burn
Batman v Superman: Dawn of Justice
JFK
Batman & Robin
Law Abiding Citizen
Secret in Their Eyes